app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    if @order.save
---
INSERT INTO "orders" ("created_at", "password", "type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 31 May 2012 15:07:21 BST +01:00], ["password", nil], ["type", "food"], ["updated_at", Thu, 31 May 2012 15:07:21 BST +01:00]]